(* list : *)

val l1 = []	(* 空のリスト *)

val l2 = [1, 2, 3 ]; (* 単純なリスト *)

val l3 = [ (1+2), 3+4, 8-4];	(* 式の評価結果が同じ型ならリストにできる *)

(* not same type .. error *)
(* val l4 = [1, "he", "hiM", ]; *)

(* リストの生成 : value::[] で、[value, ...] というリストが作成できる *)
8::[1, 4];
5::8::[];	(* :: でvalueをつなげられる / []の代わりにnilも可 *)

[6]::[[1,2], [4,8]]; (* (int list)のlist なので可 *)

(* リスト 館数 *)
(* null: 空のリストかチェック *)
[]; (null []);
[false]; (null [false]);

(* hd: 先頭要素 *)
"head & tail";
(hd [1,2,3,4,5]); (* [1] .. car *)
(tl [1, 2, 3, 4, 5]); (* [ 2, 3, 4, 5 ] .. cdr *)

(* type of [] : alpha list : []はどの方にもお変換可能 *)
[[]]
